benchmark_results_20260420/axum_light.txt
Running 30s test @ http://127.0.0.1:8081/hello
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  709.48us   8.16ms   72.17%
    Req/Sec    23.34k     1.77k   29.30k    73.33%
  2790915 requests in 30.05s, 0.97GB read
Requests/sec:  92866.33
Transfer/sec:     33.03MB